{
  "document_title": "CDC UP Lessons Learned Post Project Survey",
  "source": "CDC_UP_Lessons_Learned_Post_Project_Survey.doc",
  "description": "[The following survey is intended as a guideline, and provides sample questions that may be administered to solicit feedback on a project. The Project Manager should review the questions to determine which ones are appropriate to include for the selected target audience. The respondents should be encouraged to provide not only a numerical rating (1=Not at All/Poor; 2=Adequate/Satisfactory; 3=To a great extent/Excellent), but also provide their comments as to what worked well, what could have been done better, and recommendations for conducting future projects.]",
  "fields": {
    "Project Name": "<Project Name>",
    "Date": "<dd/mm/yyyy>"
  },
  "sections": [
    {
      "number": "1",
      "title": "Product Effectiveness",
      "questions": [
        "How well does the product or service the project produced meet the defined project requirements?",
        "How well does the product or service the project produced meet your needs?",
        "To what extent were the objectives and goals outlined in the Business Case met?",
        "What is your overall assessment of the outcome of this project?"
      ]
    },
    {
      "number": "2",
      "title": "Cost / Scope / Schedule / Quality Management",
      "questions": [
        "How well did the scope of the project match what was defined in the Project Proposal?",
        "How satisfied are you with your involvement in the development and/or review of the Project Scope during Project Initiation and Planning?",
        "Was the Change Control process properly implemented to manage changes to Cost, Scope, Schedule, or Quality?",
        "Were changes to Cost, Scope, Schedule, or Quality effectively managed?",
        "Was project performance validated or challenged? If yes, were the estimates effectively revised and were current and future tasks re-scheduled?",
        "How closely did the initial Project Schedule compare with the actual schedule?",
        "How did the estimated Project Budget compare with the total actual expenditures?",
        "How effectively was the Quality Management Plan applied during Project Execution?",
        "How effective was the quality assurance process?",
        "How effective were project audits?",
        "How effective were Best Practices & Lessons Learned from prior projects utilized in this project?"
      ]
    },
    {
      "number": "3",
      "title": "Risk Management",
      "questions": [
        "How well were team members involved in the risk identification and mitigation planning process?",
        "To what extent was the evolution of risks communicated?",
        "How accurate was the Risk Management Plan/Log?",
        "How accurately and timely was the Risk Management Log updated or reviewed?"
      ]
    },
    {
      "number": "4",
      "title": "Communication Management",
      "questions": [
        "How effective were the communications materials in providing and orienting team members about the details of the project?",
        "How satisfied were you with the kick-off meetings you participated in?",
        "How efficient were project team meetings conducted?",
        "How timely were Progress Reports provided to the Project Manager by Team Members?",
        "How actively and meaningfully were stakeholders involved in the project?",
        "Were stakeholder communications adequate and effective?",
        "How well were your expectations met regarding the frequency and content of information that was conveyed to you by the Project Manager?",
        "How well was project status communicated throughout your involvement in the project?",
        "How well were project issues communicated throughout your involvement in the project?",
        "How well did the Project Manager respond to your questions or comments related to the project?",
        "How useful was the format and content of the Project Status Report to you?",
        "How useful and complete was the project document repository?"
      ]
    },
    {
      "number": "5",
      "title": "Acceptance Management",
      "questions": [
        "How effective was the acceptance management process?",
        "How well prepared were you to receive project deliverables?",
        "How well defined was the acceptance criteria for project deliverables?",
        "Was sufficient time allocated to review project deliverables?",
        "How closely did deliverables match what was defined within the Project Scope?",
        "How complete and timely were the materials you were provided to decide whether to proceed from one project lifecycle phase to the next? If materials were lacking, please elaborate."
      ]
    },
    {
      "number": "6",
      "title": "Organizational Change Management",
      "questions": [
        "How effectively and timely was the organizational change impact identified and planned for?",
        "Was sufficient advance training conducted and/or information provided to enable those affected by the changes to adjust to and accommodate them?",
        "Overall, how effective were the efforts to prepare you and your organization for the impact of the product/service of the project?",
        "How effective were the techniques used to prepare you and your organization for the impact of the changes brought about by the product or service produced by the project?"
      ]
    },
    {
      "number": "7",
      "title": "Issue Management",
      "questions": [
        "How effectively were issues managed on the project?",
        "How effectively were issues resolved before escalation was necessary?",
        "If issue escalation was required, how effectively were issues resolved?",
        "How effectively were issues able to be resolved without impacting the Project Schedule or Budget?"
      ]
    },
    {
      "number": "8",
      "title": "Product Implementation & Support",
      "questions": [
        "How effective was the documentation that you received with the project product/service?",
        "How effective was the training you received in preparation for the use of the product/service?",
        "How useful was the content of the training you received in preparation for the use of the product/service?",
        "How timely was the training you received in preparation for the use of the product/service?",
        "How effective was the support you received during implementation of the product/service?"
      ]
    },
    {
      "number": "9",
      "title": "Performance of the Organization",
      "questions": [
        "How effectively and consistently was sponsorship for the project conveyed?"
      ]
    },
    {
      "number": "10",
      "title": "Performance of the Project Team",
      "questions": [
        "Overall, how effective was the performance of the Project Manager?",
        "How well did the Project Team understand the expectations of their specific roles and responsibilities?",
        "How well were your expectations met regarding the extent of your involvement in the project (effort, time commitments, etc.)?",
        "How effective was each Project Team member in fulfilling his/her role?",
        "How effective was Project Team member training?"
      ]
    },
    {
      "number": "11",
      "title": "General Questions",
      "questions": [
        "What were the most significant issues on this project?",
        "What were the lessons learned on this project?",
        "What on the project worked well and was effective in the delivery of the product?",
        "What other questions should we have asked? What other information would you like to provide to us about this project?"
      ]
    }
  ],
  "appendices": {
    "source": "NYS Project Management Guidebook",
    "version_history": {
      "Version#": "1.0",
      "Implemented By": "CDC UP Team",
      "Revision Date": "",
      "Reason": "Final Release"
    },
    "disclaimer": "[Insert appropriate disclaimer(s)]"
  }
}